Summary for F:\kod\pdbpy\pdbpy\example_pdbs\windows.pdb
  Size: 110592 bytes
  Guid: {A4EF112D-A965-4045-8E4D-9C0D3F83222C}
  Age: 1
  Attributes: HasPrivateSymbols 
---COMPILANDS---
  F:\kod\pdbpy\pdbpy\example_pdbs\windows.obj
    F:\kod\pdbpy\pdbpy\example_pdbs\windows.cpp (SHA256: 73455C583B2490597EE45D30FBDF874322341D62A6ABC867083831168604D0A5)
      Line 17, Address: [0x00001010 - 0x00001013] (4 bytes)
      Line 18, Address: [0x00001014 - 0x00001031] (30 bytes)
      Line 19, Address: [0x00001032 - 0x00001040] (15 bytes)
      Line 20, Address: [0x00001041 - 0x00001045] (5 bytes)
  * Linker *
---TYPES---
  Enums: (0 items)
  Function Signatures: (1 items)
    int __cdecl ()
  Typedefs: (0 items)
  Pointers: (0 items)
  Classes: (Showing 1 items)
    struct Yolo [sizeof = 16] {
      data +0x00 [sizeof=4] int x
      data +0x04 [sizeof=4] float y
      data +0x08 [sizeof=8] double* z
    }
    
---SYMBOLS---
  F:\kod\pdbpy\pdbpy\example_pdbs\windows.obj
    using namespace __vc_attributes
    using namespace helper_attributes
    using namespace atl
    using namespace std
    func [0x00001010+ 4 - 0x00001046- 5 | sizeof= 54] (FPO) int __cdecl WinMainCRTStartup()
  * Linker *
    thunk 0x00001005 -> 0x00001010 (TrampIncremental) 
    unknown (CoffGroup)
    unknown (CoffGroup)
    unknown (CoffGroup)
    unknown (CoffGroup)
    unknown (CoffGroup)
    unknown (CoffGroup)
    unknown (CoffGroup)
---GLOBALS---
  func [0x00001010+ 4 - 0x00001046- 5 | sizeof= 54] (FPO) int __cdecl WinMainCRTStartup()
  data [0x00004000, sizeof=4] static int _fltused
---EXTERNALS---
  public [0x00004000] _fltused
  public [0x00003000] __real@40000000
  public [0x00001010] ?WinMainCRTStartup@@YAHXZ
  
  